app/controllers/comments_controller.rb

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`body`, `commenter`, `created_at`, `post_id`, `updated_at`) VALUES ('egfedfgefg', 'et', '2012-12-04 07:12:32', 1, '2012-12-04 07:12:32')
---
   def create
      @post = Post.find(params[:post_id])
      @comment = @post.comments.create(params[:comment])

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 1 AND `comments`.`id` = 1 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 1
---
   def destroy
      @post = Post.find(params[:post_id])
      @comment = @post.comments.find(params[:id])
      @comment.destroy